#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/blackboards/infrastructure/runs/run-VTNdk3g2EjUDnXTe

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
digitalocean_domain.opentracker: Refreshing state... [id=opentracker.app]
digitalocean_domain.blackboards: Refreshing state... [id=blackboards.pl]
digitalocean_droplet_snapshot.original-main-snapshot: Refreshing state... [id=126133672]
digitalocean_droplet.secondary: Refreshing state... [id=332540871]
digitalocean_record.opentracker-ns1: Refreshing state... [id=313829950]
digitalocean_record.opentracker-ns3: Refreshing state... [id=313829951]
digitalocean_record.opentracker-ns2: Refreshing state... [id=313829953]
digitalocean_record.ns1: Refreshing state... [id=126390270]
digitalocean_record.ns2: Refreshing state... [id=126390272]
digitalocean_record.ns3: Refreshing state... [id=126390273]
aws_iam_access_key.personal: Refreshing state... [id=AKIAYEHTA3LZHBDUP5GT]
aws_iam_user.personal: Refreshing state... [id=alex.jackson]
aws_iam_role.iac_deployer: Refreshing state... [id=iac-deployer]
aws_iam_policy.iac_deployer: Refreshing state... [id=arn:aws:iam::558855412466:policy/iac-deployer-policy]
aws_iam_user_policy.personal: Refreshing state... [id=alex.jackson:alex.jackson.policy]
aws_s3_bucket.remote_state: Refreshing state... [id=terraform-remote-state-m3rc9k]
digitalocean_record.opentracker-root: Refreshing state... [id=313829952]
digitalocean_project.blackboards: Refreshing state... [id=d006b183-c896-4d41-a341-fb46d729eeb6]
aws_iam_role_policy_attachment.iac_deployer: Refreshing state... [id=iac-deployer-20230421061924179000000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_access_key.personal will be destroyed
  # (because aws_iam_access_key.personal is not in configuration)
  - resource "aws_iam_access_key" "personal" {
      - create_date                    = "2023-04-21T06:47:04Z" -> null
      - encrypted_secret               = "wV4DCD+fPm/O2bASAQdARBoDyxA/wyN2cyb2kr/33wpWeMSxhouLFio8m++bpjgwaOXvBcGdpSUwnTPtzrNhQZNMd5Iu4Gdi5TQgckDSOeZZ1DiErEUIyWa79pn5j3FB1GQBBwEMUQ5rp5PRrkCq1uMpmF6tIxNMC+g0akeTbgsWH/9j38eB3gq3f7r99vROzKBF/XQtzu1hwXZRhGD5rZstCplvHROaAao2wm6nQyqIKCIZwUtrxAmM9qgPI7DwjGjIAqx/" -> null
      - encrypted_ses_smtp_password_v4 = "wV4DCD+fPm/O2bASAQdA3cyzXS+9ZJIepVPIuxRv0Mw67UME+8FaqolMOr2IJE8wHWGlQ/j10ZC4NRc/XftfNIJ8mwNygTXPDJIm1KB67v0HjxNToHYFM4A+SjZ+/Bb21GgBBwEMGY1m3xETvDOzL6/P+Eyu1NSw9BFMIw1JjvxdjOwWn4i6bUFsNhVaUwublHMea4g5MlLdfG6RQMnfjAD4dcjIK7Eeb8943Ejt1tysUG0oVP1gzRCOxhpTrBl7cjFATOnxRdnfhQ==" -> null
      - id                             = "AKIAYEHTA3LZHBDUP5GT" -> null
      - key_fingerprint                = "34158575da048366a6f78818caace6c3f7a85dad" -> null
      - pgp_key                        = <<-EOT
            mDMEZEIvBhYJKwYBBAHaRw8BAQdAH6uzDXu/qjfZ8Da+qVhNJT4zsQVLJZfEwoO863fMzM+0M0FsZXhhbmRlciBKYWNrc29uIDxhbGV4YW5kZXJqYWNrc29uQHByb3Rvbm1haWwuY29tPoiZBBMWCgBBFiEENBWFddoEg2am94gYyqzmw/eoXa0FAmRCLwYCGwMFCQPCZwAFCwkIBwICIgIGFQoJCAsCBBYCAwECHgcCF4AACgkQyqzmw/eoXa3WfgD+P4SmEYWrqcxIPpMWRR9gWBLX7iU0doH1t/oGuWhEiyoBAJ20LujsrDFFe8Aw9dgyM3pZ07I+U5aGpbJyLEXAtfIHuDgEZEIvBhIKKwYBBAGXVQEFAQEHQOrRfaG6AGPd9xWWiQgO3LDLgZi/tAitK/g8VCIWrU9cAwEIB4h+BBgWCgAmFiEENBWFddoEg2am94gYyqzmw/eoXa0FAmRCLwYCGwwFCQPCZwAACgkQyqzmw/eoXa02HwD/V++JOMjmTLeds+ouVcSJ6qCq7Rtb3dIKysCnzqd49ToA/1Fv+vWnbkrJg8gOSeU/qKJPZwfYkBqWwv8ozEIlzFwG
        EOT -> null
      - status                         = "Active" -> null
      - user                           = "alex.jackson" -> null
    }

  # aws_iam_user.personal will be destroyed
  # (because aws_iam_user.personal is not in configuration)
  - resource "aws_iam_user" "personal" {
      - arn           = "arn:aws:iam::558855412466:user/alex.jackson" -> null
      - force_destroy = false -> null
      - id            = "alex.jackson" -> null
      - name          = "alex.jackson" -> null
      - path          = "/" -> null
      - tags          = {} -> null
      - tags_all      = {} -> null
      - unique_id     = "AIDAYEHTA3LZPLA7PFQW2" -> null
    }

  # aws_iam_user_policy.personal will be destroyed
  # (because aws_iam_user_policy.personal is not in configuration)
  - resource "aws_iam_user_policy" "personal" {
      - id     = "alex.jackson:alex.jackson.policy" -> null
      - name   = "alex.jackson.policy" -> null
      - policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:Get*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "sts:AssumeRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::558855412466:role/iac-deployer"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - user   = "alex.jackson" -> null
    }

  # digitalocean_droplet.opl-docs will be created
  + resource "digitalocean_droplet" "opl-docs" {
      + backups              = false
      + created_at           = (known after apply)
      + disk                 = (known after apply)
      + graceful_shutdown    = false
      + id                   = (known after apply)
      + image                = "ubuntu-22-10-x64"
      + ipv4_address         = (known after apply)
      + ipv4_address_private = (known after apply)
      + ipv6                 = false
      + ipv6_address         = (known after apply)
      + locked               = (known after apply)
      + memory               = (known after apply)
      + monitoring           = true
      + name                 = "opl-docs"
      + price_hourly         = (known after apply)
      + price_monthly        = (known after apply)
      + private_networking   = (known after apply)
      + region               = "lon1"
      + resize_disk          = true
      + size                 = "s-1vcpu-1gb"
      + ssh_keys             = (known after apply)
      + status               = (known after apply)
      + urn                  = (known after apply)
      + vcpus                = (known after apply)
      + volume_ids           = (known after apply)
      + vpc_uuid             = (known after apply)
    }

  # digitalocean_record.opl-docs will be created
  + resource "digitalocean_record" "opl-docs" {
      + domain = "blackboards.pl"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "opl-docs"
      + ttl    = (known after apply)
      + type   = "A"
      + value  = (known after apply)
    }

  # digitalocean_ssh_key.m2 will be created
  + resource "digitalocean_ssh_key" "m2" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "m2"
      + public_key  = <<-EOT
            ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQC96tgUY+n5VKu+hIUa46ZvTC2JDRx/bLY1BRpt9zWjDOeZdvf6ax+jKcQXtYTXaqXR/HvAkz+wOJ5QHa4vUxXJ3/Yc2hYmZcvId7ei2qy8ajQaxpDNMfSqE/UTaKD0pjRsKXqG5giKndnC5/LySO7es5qiN+tZoCtqm1Od1fwpznk2MtX0HB1u4DEE34ND2ByXHvcfN+JVxOIYNVT3e19K5BtkGt7oZNTfJNiGK5OL/2Tc+tPV4JM/kiBcCnT+p9UwI3m+UqkMfw+7UjtyNyWE5XqHFPgE0EEVBmW9pbCqGcPMvL3qByG7qNns01XhdUAsx/Ln4CPRwaKj34Di2rlcDrPGpnkni+VXxVSipqtuWuLFXVGLUDmSlWMU/uL7nuBWwFqj1Gb+7Z0c9FBVm1qtxVNSavWSf/kiJSTQtFj6qRfIC2NQ8WX3BzX7WZFc6E3sgdcfnj4r1HwTQboJ82v5cVK3WeBT4zIFfaugqSwZ1enLnbJQGoi/wktn26rllzuwLJHxom2S13oxZDhwPdSMIDy3AbYo1g95KYhgFPofN4lG6Def4dtyEziMSwgbEAyICCTAbtM96a/Kuno764ZydcS+NsKJb/mBufMZh56cNNOU+ldLxJe9wOEFJMmYI7PLgBSb4wCsMmRfx9hBysvmCs2PUmD4xy+eNXGG3wWHYw== primary
        EOT
    }

Plan: 3 to add, 0 to change, 3 to destroy.

```

</details>